---
kind: method
id: M:Autodesk.Revit.DB.ScheduleFilter.SetValue(System.Int32)
source: html/2f52924c-8851-6512-c2b0-28205a799c21.htm
---
# Autodesk.Revit.DB.ScheduleFilter.SetValue Method

Set the filter value to an integer.

## Syntax (C#)
```csharp
public void SetValue(
	int value
)
```

## Parameters
- **value** (`System.Int32`) - The filter value.